In [1]:
import pandas as pd
import os

In [11]:
filename = "Regional Price Parities by State -WIP.xlsx"

In [12]:
data = pd.read_excel(filename)

In [13]:
data.head(9)

,GeoFips,GeoName,LineCode,Description,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
0,0,United States,1,All items,100.0,100.0,100.0,100.0,100.0,100.0,100.0,100.0,100.0,100.0,100.0,100.0
1,0,United States,2,Goods,99.5,99.5,99.4,99.4,99.4,99.4,99.4,99.4,99.3,99.3,99.2,99.2
2,0,United States,3,Services: Rents,100.9,100.9,101.3,101.3,101.1,101.2,101.1,101.1,101.3,101.3,101.4,101.4
3,0,United States,4,Services: Other,100.1,100.1,100.0,100.0,100.0,100.0,100.1,100.0,100.0,99.9,99.9,100.0
4,1000,Alabama,1,All items,87.6,87.5,87.9,87.7,88.1,87.8,87.1,86.8,86.1,85.5,85.9,85.8
5,1000,Alabama,2,Goods,97.6,97.6,96.6,96.3,96.2,96.0,96.2,96.4,96.1,95.7,95.9,95.9
6,1000,Alabama,3,Services: Rents,63.9,63.7,63.8,63.1,64.4,63.6,63.8,62.8,63.1,63.1,61.8,61.9
7,1000,Alabama,4,Services: Other,93.6,93.2,93.2,93.5,93.7,94.0,93.3,93.3,91.8,90.4,90.3,90.3
8,2000,Alaska,1,All items,106.9,106.9,105.5,105.1,105.4,104.9,106.3,105.5,105.7,105.9,105.7,105.1

In [19]:
data.tail(6)

,GeoFips,GeoName,LineCode,Description,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
202,55000,Wisconsin,3,Services: Rents,89.0,88.0,87.1,88.0,87.6,86.2,86.6,85.8,84.7,84.2,83.7,83.7
203,55000,Wisconsin,4,Services: Other,91.9,91.9,92.1,92.8,93.7,93.2,93.6,93.1,92.5,92.3,92.3,92.3
204,56000,Wyoming,1,All items,96.1,96.1,95.9,96.7,95.8,96.0,96.8,96.4,95.9,94.0,92.3,92.8
205,56000,Wyoming,2,Goods,98.9,98.8,98.9,98.6,98.3,98.3,98.8,99.4,97.7,96.8,96.7,96.7
206,56000,Wyoming,3,Services: Rents,85.1,87.7,87.8,94.2,90.7,89.9,93.5,91.5,92.8,85.6,80.7,82.4
207,56000,Wyoming,4,Services: Other,97.6,96.2,95.9,95.5,95.2,96.1,96.0,95.2,95.0,94.7,94.8,94.8

In [20]:
data.shape

(208, 16)

In [21]:
cols = data.columns.values
cols

array(['GeoFips', 'GeoName', 'LineCode', 'Description', '2008', '2009',
       '2010', '2011', '2012', '2013', '2014', '2015', '2016', '2017',
       '2018', '2019'], dtype=object)

In [18]:
n_cols = len(cols)
n_cols

16

In [22]:
data.describe()

,GeoFips,LineCode,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
count,208.000000,208.000000,208.000000,208.000000,208.000000,208.000000,208.000000,208.000000,208.000000,208.000000,208.000000,208.000000,208.000000,208.000000
mean,28403.846154,2.500000,97.606250,97.677404,97.259135,97.350481,97.454327,97.451923,97.515385,97.383173,97.145673,96.982212,96.870192,96.828846
std,16065.397286,1.120731,13.910904,13.921707,13.738205,13.586765,13.528134,13.320628,13.702616,13.470768,13.269291,13.596086,13.320547,13.534366
min,0.000000,1.000000,60.100000,61.600000,62.500000,63.100000,62.400000,62.900000,62.900000,62.800000,63.100000,61.400000,60.800000,60.000000
25%,15750.000000,1.750000,92.150000,92.075000,91.875000,92.500000,92.175000,92.200000,92.550000,92.650000,91.775000,91.675000,91.500000,91.500000
50%,28500.000000,2.500000,97.600000,97.700000,97.100000,97.200000,97.200000,97.200000,96.800000,96.550000,96.250000,96.000000,96.100000,96.150000
75%,41250.000000,3.250000,101.725000,101.650000,101.450000,101.400000,100.850000,100.825000,101.225000,101.525000,101.900000,102.125000,101.925000,102.225000
max,56000.000000,4.000000,167.500000,164.600000,159.200000,157.300000,159.100000,159.300000,161.600000,163.400000,157.200000,156.300000,152.600000,153.600000

In [23]:
data.dtypes

GeoFips          int64
GeoName         object
LineCode         int64
Description     object
2008           float64
2009           float64
2010           float64
2011           float64
2012           float64
2013           float64
2014           float64
2015           float64
2016           float64
2017           float64
2018           float64
2019           float64
dtype: object

## celdas vacías?

In [33]:
pd.isnull(data[cols[1]])

0      False
1      False
2      False
3      False
4      False
       ...
203    False
204    False
205    False
206    False
207    False
Name: GeoName, Length: 208, dtype: bool

In [34]:
pd.isnull(data[cols[1]]).values.ravel()

array([False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False])

In [35]:
subset = data[["GeoName", "Description", "2008", "2009","2010", "2011", "2012", "2013", "2014", "2015", "2016", "2017","2018", "2019"]]

In [36]:
subset.head()

,GeoName,Description,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
0,United States,All items,100.0,100.0,100.0,100.0,100.0,100.0,100.0,100.0,100.0,100.0,100.0,100.0
1,United States,Goods,99.5,99.5,99.4,99.4,99.4,99.4,99.4,99.4,99.3,99.3,99.2,99.2
2,United States,Services: Rents,100.9,100.9,101.3,101.3,101.1,101.2,101.1,101.1,101.3,101.3,101.4,101.4
3,United States,Services: Other,100.1,100.1,100.0,100.0,100.0,100.0,100.1,100.0,100.0,99.9,99.9,100.0
4,Alabama,All items,87.6,87.5,87.9,87.7,88.1,87.8,87.1,86.8,86.1,85.5,85.9,85.8

In [41]:
df = subset.drop([0,1,2,3])
df

,GeoName,Description,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
4,Alabama,All items,87.6,87.5,87.9,87.7,88.1,87.8,87.1,86.8,86.1,85.5,85.9,85.8
5,Alabama,Goods,97.6,97.6,96.6,96.3,96.2,96.0,96.2,96.4,96.1,95.7,95.9,95.9
6,Alabama,Services: Rents,63.9,63.7,63.8,63.1,64.4,63.6,63.8,62.8,63.1,63.1,61.8,61.9
7,Alabama,Services: Other,93.6,93.2,93.2,93.5,93.7,94.0,93.3,93.3,91.8,90.4,90.3,90.3
8,Alaska,All items,106.9,106.9,105.5,105.1,105.4,104.9,106.3,105.5,105.7,105.9,105.7,105.1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
203,Wisconsin,Services: Other,91.9,91.9,92.1,92.8,93.7,93.2,93.6,93.1,92.5,92.3,92.3,92.3
204,Wyoming,All items,96.1,96.1,95.9,96.7,95.8,96.0,96.8,96.4,95.9,94.0,92.3,92.8
205,Wyoming,Goods,98.9,98.8,98.9,98.6,98.3,98.3,98.8,99.4,97.7,96.8,96.7,96.7
206,Wyoming,Services: Rents,85.1,87.7,87.8,94.2,90.7,89.9,93.5,91.5,92.8,85.6,80.7,82.4
207,Wyoming,Services: Other,97.6,96.2,95.9,95.5,95.2,96.1,96.0,95.2,95.0,94.7,94.8,94.8

In [44]:
df.head(7)

,GeoName,Description,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
4,Alabama,All items,87.6,87.5,87.9,87.7,88.1,87.8,87.1,86.8,86.1,85.5,85.9,85.8
5,Alabama,Goods,97.6,97.6,96.6,96.3,96.2,96.0,96.2,96.4,96.1,95.7,95.9,95.9
6,Alabama,Services: Rents,63.9,63.7,63.8,63.1,64.4,63.6,63.8,62.8,63.1,63.1,61.8,61.9
7,Alabama,Services: Other,93.6,93.2,93.2,93.5,93.7,94.0,93.3,93.3,91.8,90.4,90.3,90.3
8,Alaska,All items,106.9,106.9,105.5,105.1,105.4,104.9,106.3,105.5,105.7,105.9,105.7,105.1
9,Alaska,Goods,102.8,102.8,102.5,101.9,101.3,101.1,101.3,101.7,101.8,102.2,102.3,102.3
10,Alaska,Services: Rents,133.8,139.3,133.0,136.8,141.9,138.9,144.4,139.4,137.4,132.0,125.9,122.3

In [46]:
df.describe()

,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
count,204.000000,204.000000,204.000000,204.000000,204.000000,204.000000,204.000000,204.000000,204.000000,204.000000,204.000000,204.000000
mean,97.556863,97.629412,97.201961,97.295098,97.401961,97.399020,97.463725,97.329412,97.086765,96.920588,96.806373,96.763725
std,14.042574,14.053740,13.866396,13.713783,13.655248,13.445475,13.831653,13.597012,13.392233,13.721773,13.442763,13.658497
min,60.100000,61.600000,62.500000,63.100000,62.400000,62.900000,62.900000,62.800000,63.100000,61.400000,60.800000,60.000000
25%,91.975000,91.975000,91.800000,92.175000,92.075000,91.875000,92.075000,92.375000,91.700000,91.575000,91.400000,91.500000
50%,97.550000,97.700000,97.000000,96.950000,97.000000,96.950000,96.650000,96.450000,96.150000,95.900000,96.000000,96.050000
75%,101.850000,101.850000,101.675000,101.400000,100.850000,100.825000,101.400000,101.625000,101.975000,102.275000,102.325000,102.325000
max,167.500000,164.600000,159.200000,157.300000,159.100000,159.300000,161.600000,163.400000,157.200000,156.300000,152.600000,153.600000

In [66]:
df2 = df[df["Description"]=="Services: Rents"]
df2.shape

(51, 14)

In [67]:
df2.head(6)

,GeoName,Description,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
6,Alabama,Services: Rents,63.9,63.7,63.8,63.1,64.4,63.6,63.8,62.8,63.1,63.1,61.8,61.9
10,Alaska,Services: Rents,133.8,139.3,133.0,136.8,141.9,138.9,144.4,139.4,137.4,132.0,125.9,122.3
14,Arizona,Services: Rents,102.6,100.3,95.1,94.2,93.8,91.8,91.4,91.4,91.7,92.9,94.3,94.1
18,Arkansas,Services: Rents,62.4,61.6,63.2,63.1,63.2,63.2,62.9,63.9,63.7,62.0,60.8,60.9
22,California,Services: Rents,154.6,153.7,150.9,149.1,147.5,145.8,147.4,147.3,148.2,150.5,152.6,153.6
26,Colorado,Services: Rents,107.1,106.9,104.4,106.5,106.3,109.6,111.3,114.7,117.5,120.6,120.7,124.7

In [69]:
RentsParities = df2.drop(["Description"], axis=1)

In [70]:
RentsParities.head(6)

,GeoName,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
6,Alabama,63.9,63.7,63.8,63.1,64.4,63.6,63.8,62.8,63.1,63.1,61.8,61.9
10,Alaska,133.8,139.3,133.0,136.8,141.9,138.9,144.4,139.4,137.4,132.0,125.9,122.3
14,Arizona,102.6,100.3,95.1,94.2,93.8,91.8,91.4,91.4,91.7,92.9,94.3,94.1
18,Arkansas,62.4,61.6,63.2,63.1,63.2,63.2,62.9,63.9,63.7,62.0,60.8,60.9
22,California,154.6,153.7,150.9,149.1,147.5,145.8,147.4,147.3,148.2,150.5,152.6,153.6
26,Colorado,107.1,106.9,104.4,106.5,106.3,109.6,111.3,114.7,117.5,120.6,120.7,124.7

In [74]:
df3 = df[df["Description"]=="Goods"]
GoodsParities = df3.drop(["Description"], axis=1)
GoodsParities.head(6)

,GeoName,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
5,Alabama,97.6,97.6,96.6,96.3,96.2,96.0,96.2,96.4,96.1,95.7,95.9,95.9
9,Alaska,102.8,102.8,102.5,101.9,101.3,101.1,101.3,101.7,101.8,102.2,102.3,102.3
13,Arizona,101.2,101.0,100.6,99.4,98.6,98.1,97.5,96.8,95.7,94.8,94.9,94.8
17,Arkansas,96.6,96.7,95.7,95.2,94.9,94.6,94.7,94.9,94.8,94.6,94.7,94.7
21,California,103.5,103.2,103.0,103.0,103.1,103.7,103.7,103.8,103.9,104.9,104.8,104.9
25,Colorado,101.7,102.0,101.9,101.4,100.2,99.9,99.6,99.4,98.2,97.4,97.2,97.1